Revit 2024 API
PreviewControl Class
 Presents a preview control to browse the Revit model.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class PreviewControl : UserControl,
	IDisposable
Visual Basic
Public Class PreviewControl _
	Inherits UserControl _
	Implements IDisposable
Visual C++
public ref class PreviewControl : public UserControl,
	IDisposable
Remarks
 The dialog or form or window host this preview control must be modal. The view can be any graphical view but not a non-graphical view. And only one can be active. The view can be manipulated by embedded view cube and the visibility and graphical settings set on the view will be evident in the preview control.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Autodesk.Revit.UI.PreviewControl
See Also
PreviewControl Members
Autodesk.Revit.UI Namespace